# DividedPathInvalidNumberOfPoints Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DividedPathFailures..::..DividedPathInvalidNumberOfPoints Property
BuiltInFailures..::..DividedPathFailures Class See Also
---
End indent is too large.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DividedPathInvalidNumberOfPoints { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DividedPathInvalidNumberOfPoints As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DividedPathInvalidNumberOfPoints {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DividedPathFailures Class
Autodesk.Revit.DB Namespace